// ДЗ 4. Практика на умовні оператори

// 1) Дано два різні числа. Визначити, яке з них більше, а яке менше.

let number1 = 5
let number2 = 3

if (number1 > number2) {
  console.log(number1 + ' є більшим числом.')
  console.log(number2 + ' є меншим числом.')
} else if (number2 > number1) {
  console.log(number2 + ' є більшим числом.')
  console.log(number1 + ' є меншим числом.')
} else {
  console.log('Числа рівні.')
}

// 2) Відомі дві відстані. Одне у кілометрах, інше – у футах (1 фут = 0,305м). Яка відстань менша?

let distanceInKilometers = 5 // в кілометрах
let distanceInFeet = 25 // в футах

// Переведемо відстань у футах в кілометри
let convertedDistanceInKilometers = distanceInFeet * 0.305

// Порівняємо дві відстані
if (distanceInKilometers < convertedDistanceInKilometers) {
  console.log('Відстань в кілометрах менша.')
} else if (distanceInKilometers > convertedDistanceInKilometers) {
  console.log('Відстань у футах менша.')
} else {
  console.log('Відстані рівні.')
}

//  3) Визначити, чи є число a дільником числа b? І навпаки. (Дати дві відповіді)

let a = 8
let b = 2

// Перевірка, чи є a дільником b
if (b % a === 0) {
  console.log(a + ' є дільником ' + b)
} else {
  console.log(a + ' не є дільником ' + b)
}

// Перевірка, чи є b дільником a
if (a % b === 0) {
  console.log(b + ' є дільником ' + a)
} else {
  console.log(b + ' не є дільником ' + a)
}

// 4) Дано число. Визначити, чи закінчується воно парною цифрою чи непарною? Вивести останню цифру.

let number = 287

function checkLastDigit(number) {
  let lastDigit = number % 10 // Отримуємо останню цифру числа

  if (lastDigit % 2 === 0) {
    console.log('Остання цифра є парною: ' + lastDigit)
  } else {
    console.log('Остання цифра є непарною: ' + lastDigit)
  }
}
//  виклик функції
checkLastDigit(number)

// 5) Дано двозначне число. Визначити, яка з його цифр більша: перша чи друга?

const numbers = 55

const firstDigit = Math.floor(numbers / 10)
const secondDigit = numbers % 10

if (firstDigit > secondDigit) {
  console.log('Перша цифра більша')
} else if (secondDigit > firstDigit) {
  console.log('Друга цифра більша')
} else {
  console.log('Обидві цифри рівні')
}

// 6) Дано тризначне число.
//Визначити чи є парною сума його цифр.
//Визначити, чи кратна сума цифр п'яти.
//Визначити чи є добуток його цифр більше 100.

//не зміг вирішити

//7) Дано тризначне число.
//Чи правда, що всі цифри однакові?
//Чи є серед цифр цифри однакові?

//не зміг вирішити

//8) Визначити, чи є задане шестизначне число дзеркальним? (123321, 147741)

//не зміг вирішити

//===========================================================================================================

//ДЗ 5. Збір інформації про користувача

/*Запросити у користувача рік народження.

Запитати в нього, в якому місті він живе.

Запитати його улюблений вид спорту.

При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:

Його вік.
Якщо користувач запровадить Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицю якої він запровадив. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.
Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач запровадить один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати…” і підставляємо на місце точок ім'я та прізвище чемпіона.

Все це має бути відображено в одному вікні (алерті).

Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення - "Шкода, що Ви не захотіли ввести свій(ю) ..." і вказуємо, що він не захотів вводити - дату народження, місто або вид спорту.*/

// Запитати рік народження
let birthYear = prompt('Введіть рік народження:')

// Перевірити, чи користувач натиснув Скасувати або не ввів дані
if (birthYear === null || birthYear === '') {
  alert('Шкода, що Ви не захотіли ввести свій рік народження.')
} else {
  // Запитати місто проживання
  let city = prompt('Введіть місто, в якому ви живете:')

  // Перевірити, чи користувач натиснув Скасувати або не ввів дані
  if (city === null || city === '') {
    alert('Шкода, що Ви не захотіли ввести своє місто проживання.')
  } else {
    // Запитати улюблений вид спорту
    let sport = prompt('Введіть ваш улюблений вид спорту:')

    // Перевірити, чи користувач натиснув Скасувати або не ввів дані
    if (sport === null || sport === '') {
      alert('Шкода, що Ви не захотіли ввести свій улюблений вид спорту.')
    } else {
      // Отримати поточний рік
      let currentYear = new Date().getFullYear()

      // Обчислити вік
      let age = currentYear - parseInt(birthYear)

      // Перевірити, чи користувач живе у столиці
      if (city === 'Київ' || city === 'Вашингтон' || city === 'Лондон') {
        alert(
          'Ти живеш у столиці ' + city + ', ' + getCountryCapital(city) + '!'
        )
      } else {
        alert('Ти живеш у місті ' + city + '!')
      }

      //  дані про спорт та чемпіонів
      let sportsData = {
        футбол: 'Ліонель Мессі',
        теніс: 'Рафаель Надаль',
        бокс: 'Василь Ломаченко',
      }

      // Отримуємо від користувача вибраний вид спорту
      let chosenSport = prompt(
        'Виберіть один із трьох видів спорту: футбол, теніс, бокс'
      )

      // Перевіряємо, чи вибраний вид спорту є в об'єкті sportsData
      if (sportsData.hasOwnProperty(chosenSport)) {
        let champion = sportsData[chosenSport]
        let message = 'Круто! Хочеш стати ' + champion + '?'
        alert(message)
      } else {
        alert('Виберіть один із трьох видів спорту: футбол, теніс, бокс')
      }

      // Показати вік
      alert('Твій вік: ' + age)
    }
  }
}

//================================================================

// ДЗ 6. Переписати код на switch

// let numOrStr = prompt('input number or string');
// console.log(numOrStr)

// if(numOrStr === null) {
//     console.log('ви відмінили')
// } else if( numOrStr.trim() === '' ) {
//     console.log('Empty String');
// } else if( isNaN( +numOrStr ) ) {
//     console.log(' number is Ba_NaN')
// } else {
//     console.log('OK!')
// }

let numOrStr = prompt('input number or string')
console.log(numOrStr)

switch (true) {
  case numOrStr === null:
    console.log('ви відмінили')
    break
  case numOrStr.trim() === '':
    console.log('Empty String')
    break
  case isNaN(+numOrStr):
    console.log('number is Ba_NaN')
    break
  default:
    console.log('OK!')
    break
}

//================================================================

// ДЗ 7. Переписати код на switch

/*
Вивести на сторінку в один рядок через кому числа від 10 до 20
Вивести квадрати чисел від 10 до 20
Вивести таблицю множення на 7
Знайти суму всіх цілих чисел від 1 до 15
Знайти добуток усіх цілих чисел від 15 до 35
Знайти середнє арифметичне всіх цілих чисел від 1 до 500
Вивести суму лише парних чисел у діапазоні від 30 до 80
Вивести всі числа в діапазоні від 100 до 200 
Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
Визначити кількість його парних дільників
Знайти суму його парних дільників
Надрукувати повну таблицю множення від 1 до 10
*/

//Вивести на сторінку в один рядок через кому числа від 10 до 20

let numb = []
for (let i = 10; i <= 20; i++) {
  numb.push(i)
}
let result = numb.join(', ')
console.log(result)

//Вивести квадрати чисел від 10 до 20

for (let i = 10; i <= 20; i++) {
  let square = i * i
  console.log(square + ' ')
}

// Вивести таблицю множення на 7
//не вирішив

//Знайти суму всіх цілих чисел від 1 до 15

let sum = 0
for (let i = 1; i <= 15; i++) {
  sum += i
}
console.log('Сума: ' + sum)

//Знайти добуток усіх цілих чисел від 15 до 35

let product = 1
for (let i = 15; i <= 35; i++) {
  product *= i
}
console.log('Добуток: ' + product)

//Знайти середнє арифметичне всіх цілих чисел від 1 до 500

let summ = 0
let count = 0
for (let i = 1; i <= 500; i++) {
  summ += i
  count++
}
let average = summ / count
console.log('Середнє арифметичне: ' + average)

//Вивести суму лише парних чисел у діапазоні від 30 до 80

let summm = 0
for (let i = 30; i <= 80; i++) {
  if (i % 2 === 0) {
    summm += i
  }
}
console.log('Сума парних чисел: ' + summm)

//Вивести всі числа в діапазоні від 100 до 200

for (let i = 100; i <= 200; i++) {
  console.log(i)
}

//Дано натуральне число. Знайти та вивести на сторінку всі його дільники.Визначити кількість його парних дільників.Знайти суму його парних дільників
// не вирішив

//Надрукувати повну таблицю множення від 1 до 10
// не вирішив

//================================================================

// ДЗ 8. Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)
//Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
//Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N
//Дано ціле число. З'ясувати, чи воно простим (простим називається число, більше ніж 1, які мають інших дільників крім 1 і себе).
//Дано кілька. Визначити, чи можна одержати це число шляхом зведення числа 3 деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна)

//Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)
for (let i = 20; i <= 30; i += 0.5) {
  console.log(i)
}

//Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
const exchangeRate = 40
for (let dollars = 10; dollars <= 100; dollars += 10) {
  const uah = dollars * exchangeRate
  console.log(`${dollars} доларів = ${uah} гривень`)
}

//Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N

const N = 100
for (let i = 1; i <= 100; i++) {
  const square = i * i
  if (square <= N) {
    console.log(i)
  }
}

//Дано ціле число. З'ясувати, чи воно простим (простим називається число, більше ніж 1, які мають інших дільників крім 1 і себе).
//не вирішив

//Дано кілька. Визначити, чи можна одержати це число шляхом зведення числа 3 деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна)
//не вирішив
